## QA testing
Without acceptance tests, below are my own QA tests run in my dev environment. Using MAAS edge (e198df6e). Before each destroy was run, it was tested using the UI that each VM host successfully commissioned  all VMs in the project. 

New cert, key, and password
```
terraform {
  required_providers {
    maas = {
      source  = "registry.terraform.io/canonical/maas"
      version = "=1.0.1"
    }
  }
}

resource "maas_vm_host" "test" {
  type          = "lxd"
  power_address = "10.10.0.1"
  project       = "maas"
  certificate   = file("~/vmhost.crt")
  key           = file("~/vmhost.key")
  password      = "Frail1-Snort-Nutlike"
}
```

```shell
❯ terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # maas_vm_host.test will be created
  + resource "maas_vm_host" "test" {
      + certificate                   = (sensitive value)
      + cpu_over_commit_ratio         = (known after apply)
      + default_macvlan_mode          = (known after apply)
      + id                            = (known after apply)
      + key                           = (sensitive value)
      + memory_over_commit_ratio      = (known after apply)
      + name                          = (known after apply)
      + password                      = (sensitive value)
      + pool                          = (known after apply)
      + power_address                 = "10.10.0.1"
      + project                       = "maas"
      + resources_cores_total         = (known after apply)
      + resources_local_storage_total = (known after apply)
      + resources_memory_total        = (known after apply)
      + tags                          = (known after apply)
      + type                          = "lxd"
      + zone                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
maas_vm_host.test: Creating...
maas_vm_host.test: Still creating... [10s elapsed]
maas_vm_host.test: Creation complete after 10s [id=100]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
❯ terraform destroy
maas_vm_host.test: Refreshing state... [id=100]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # maas_vm_host.test will be destroyed
  - resource "maas_vm_host" "test" {
      - certificate                   = (sensitive value) -> null
      - cpu_over_commit_ratio         = 1 -> null
      - id                            = "100" -> null
      - key                           = (sensitive value) -> null
      - memory_over_commit_ratio      = 1 -> null
      - name                          = "giving-hare" -> null
      - password                      = (sensitive value) -> null
      - pool                          = "default" -> null
      - power_address                 = "10.10.0.1" -> null
      - project                       = "maas" -> null
      - resources_cores_total         = 12 -> null
      - resources_local_storage_total = 499680116736 -> null
      - resources_memory_total        = 16128 -> null
      - tags                          = [
          - "pod-console-logging",
        ] -> null
      - type                          = "lxd" -> null
      - zone                          = "default" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

maas_vm_host.test: Destroying... [id=100]
maas_vm_host.test: Destruction complete after 0s

Destroy complete! Resources: 1 destroyed.

```

Only password specified 
```
terraform {
  required_providers {
    maas = {
      source  = "registry.terraform.io/canonical/maas"
      version = "=1.0.1"
    }
  }
}

resource "maas_vm_host" "test" {
  type          = "lxd"
  power_address = "10.10.0.1"
  project       = "maas"
  password      = "Frail1-Snort-Nutlike"
}
```

```shell
❯ terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # maas_vm_host.test will be created
  + resource "maas_vm_host" "test" {
      + cpu_over_commit_ratio         = (known after apply)
      + default_macvlan_mode          = (known after apply)
      + id                            = (known after apply)
      + memory_over_commit_ratio      = (known after apply)
      + name                          = (known after apply)
      + password                      = (sensitive value)
      + pool                          = (known after apply)
      + power_address                 = "10.10.0.1"
      + project                       = "maas"
      + resources_cores_total         = (known after apply)
      + resources_local_storage_total = (known after apply)
      + resources_memory_total        = (known after apply)
      + tags                          = (known after apply)
      + type                          = "lxd"
      + zone                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
maas_vm_host.test: Creating...
maas_vm_host.test: Still creating... [10s elapsed]
maas_vm_host.test: Creation complete after 15s [id=104]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
❯ terraform destroy
maas_vm_host.test: Refreshing state... [id=104]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # maas_vm_host.test will be destroyed
  - resource "maas_vm_host" "test" {
      - cpu_over_commit_ratio         = 1 -> null
      - id                            = "104" -> null
      - memory_over_commit_ratio      = 1 -> null
      - name                          = "brave-bedbug" -> null
      - password                      = (sensitive value) -> null
      - pool                          = "default" -> null
      - power_address                 = "10.10.0.1" -> null
      - project                       = "maas" -> null
      - resources_cores_total         = 12 -> null
      - resources_local_storage_total = 499680116736 -> null
      - resources_memory_total        = 16128 -> null
      - tags                          = [
          - "pod-console-logging",
        ] -> null
      - type                          = "lxd" -> null
      - zone                          = "default" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

maas_vm_host.test: Destroying... [id=104]
maas_vm_host.test: Destruction complete after 0s

Destroy complete! Resources: 1 destroyed.
```

A pre trusted cert and key have been passed. 
```
terraform {
  required_providers {
    maas = {
      source  = "registry.terraform.io/canonical/maas"
      version = "=1.0.1"
    }
  }
}

resource "maas_vm_host" "test" {
  type          = "lxd"
  power_address = "10.10.0.1"
  project       = "maas"
  certificate   = file("~/vmhost.crt")
  key           = file("~/vmhost.key")
}
```

```shell
❯ terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # maas_vm_host.test will be created
  + resource "maas_vm_host" "test" {
      + certificate                   = (sensitive value)
      + cpu_over_commit_ratio         = (known after apply)
      + default_macvlan_mode          = (known after apply)
      + id                            = (known after apply)
      + key                           = (sensitive value)
      + memory_over_commit_ratio      = (known after apply)
      + name                          = (known after apply)
      + pool                          = (known after apply)
      + power_address                 = "10.10.0.1"
      + project                       = "maas"
      + resources_cores_total         = (known after apply)
      + resources_local_storage_total = (known after apply)
      + resources_memory_total        = (known after apply)
      + tags                          = (known after apply)
      + type                          = "lxd"
      + zone                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
maas_vm_host.test: Creating...
maas_vm_host.test: Still creating... [10s elapsed]
maas_vm_host.test: Creation complete after 13s [id=106]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
❯ terraform destroy
maas_vm_host.test: Refreshing state... [id=106]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # maas_vm_host.test will be destroyed
  - resource "maas_vm_host" "test" {
      - certificate                   = (sensitive value) -> null
      - cpu_over_commit_ratio         = 1 -> null
      - id                            = "106" -> null
      - key                           = (sensitive value) -> null
      - memory_over_commit_ratio      = 1 -> null
      - name                          = "sacred-insect" -> null
      - pool                          = "default" -> null
      - power_address                 = "10.10.0.1" -> null
      - project                       = "maas" -> null
      - resources_cores_total         = 12 -> null
      - resources_local_storage_total = 499680116736 -> null
      - resources_memory_total        = 16128 -> null
      - tags                          = [
          - "pod-console-logging",
        ] -> null
      - type                          = "lxd" -> null
      - zone                          = "default" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

maas_vm_host.test: Destroying... [id=106]
maas_vm_host.test: Destruction complete after 1s

Destroy complete! Resources: 1 destroyed.
```

Note that now, if no certificate, key, or password is supplied, the resource will fail to create. This differs from the original behaviour, which allows you to create a VM Host that's untrusted. This is deemed acceptable because the team has decided that a user should aim to fully manage the VM Host with terraform, or not at all. 
```
terraform {
  required_providers {
    maas = {
      source  = "registry.terraform.io/canonical/maas"
      version = "=1.0.1"
    }
  }
}

resource "maas_vm_host" "test" {
  type          = "lxd"
  power_address = "10.10.0.1"
  project       = "maas"
}
```

```shell
❯ terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # maas_vm_host.test will be created
  + resource "maas_vm_host" "test" {
      + cpu_over_commit_ratio         = (known after apply)
      + default_macvlan_mode          = (known after apply)
      + id                            = (known after apply)
      + memory_over_commit_ratio      = (known after apply)
      + name                          = (known after apply)
      + pool                          = (known after apply)
      + power_address                 = "10.10.0.1"
      + project                       = "maas"
      + resources_cores_total         = (known after apply)
      + resources_local_storage_total = (known after apply)
      + resources_memory_total        = (known after apply)
      + tags                          = (known after apply)
      + type                          = "lxd"
      + zone                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
maas_vm_host.test: Creating...
╷
│ Error: ServerError: 503 Service Unavailable (Failed talking to pod: VM Host 107: Certificate is not trusted and no password was given)
│ 
│   with maas_vm_host.test,
│   on main.tf line 10, in resource "maas_vm_host" "test":
│   10: resource "maas_vm_host" "test" {
│ 
╵
```